import './post.css';

export default function Post() {
  return (
    <div className="post">
      <img src="metaverse.webp" alt="" className="postImg"></img>
      <div className="postInfo">
        <div className="postCats">
          <span className="postCat">تکنولوژی</span>
        </div>
        <span className="postTitle">آموزش پرامیس ها در جاوا اسکریپت</span>
        <span className="postDate">یک ساعت پیش</span>
      </div>
      <p className="postDesc">
        تا چند وقت پیش از متاورس زاکربرگی می‌ترسیدیم؛ حالا متاورس چینی با
        سرمایه‌گذاری ۸ تریلیون دلاری شرکت‌هایی همچون علی‌بابا و تنسنت ممکن است
        از رگِ گردن به ما نزدیک‌تر باشد. متاورس به‌معنی «فراتر از جهان» است. این
        ایده‌ی جدیدی نیست و اولین استفاده از این کلمه به کتاب علمی‌تخیلی «سقوط
        برفی» (Snow Crash) در سال ۱۹۹۲ برمی‌گردد؛ با‌این‌حال، مارک زاکربرگ،
        اولین نماینده‌ از دنیای غول‌های تکنولوژی بود که برنامه‌ی شرکتش فیسبوک که
        بعداً به «متا» تغییر نام داد،‌ برای ایجاد متاورس اعلام کرد و باعث شد
        برای مدتی، بسیاری از کاربران اینترنتی با شنیدن نام متاورس، یاد زاکربرگ و
        رسوایی‌های) فیسبوک بیفتند. بااین‌حال، کم‌کم بازیگران دیگر نیز متوجه
        ظرفیت نامتناهی متاورس شدند و از برنامه‌های خود برای به‌دست‌آوردن سهمی از
        نسل بعدی اینترنت صحبت کردند. درحالی‌که برای متاورس ویژگی‌های خاصی نظیر
        حضور (Presence) و تعامل‌پذیری (Interoperability) تعریف شده است، هنوز کسی
        از شکل نهایی آن خبر ندارد و در‌این‌میان، هریک از شرکت‌های بزرگ فناوری
        سعی می‌کند نسخه‌ی مدنظرش را به‌عنوان آینده‌ی اینترنت معرفی کند.
      </p>
    </div>
  );
}
